/* eslint-disable react/no-unescaped-entities */
import React from "react";
import "./style.css";
import Link from "next/link";
const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy-container">
      <h1>Політика конфіденційності</h1>

      <h2>Загальні положення</h2>
      <p>
        Дякуємо за вибір DaSushi! Ми робимо все можливе, щоб забезпечити захист
        вашої конфіденційності та особистих даних.
      </p>

      <h2>Збір та використання інформації</h2>
      <p>
        Ми можемо збирати особисту інформацію, яку ви надаєте, таку як ім'я,
        контактні дані та адреса, для забезпечення наших послуг. Ця інформація
        використовується виключно для виконання доставки та зв'язку з вами щодо
        вашого замовлення.
      </p>

      <h2>Захист даних</h2>
      <p>
        Ми вживаємо відповідних заходів для захисту ваших особистих даних та
        інформації про ваші замовлення. Ваші дані залишаються конфіденційними та
        не передаються третім особам без вашого дозволу, крім випадків,
        передбачених законодавством.
      </p>

      <h2>Cookies та Інші Технології</h2>
      <p>
        Наш веб-сайт може використовувати cookies та інші технології для
        поліпшення користувацького досвіду. Вони не збирають особисту інформацію
        без вашого відома.
      </p>

      <h2>Зміни у політиці конфіденційності</h2>
      <p>
        Ми можемо час від часу оновлювати цю політику конфіденційності. Будь
        ласка, періодично переглядайте цей документ, щоб бути в курсі змін.
      </p>

      <h2>Контактна Інформація</h2>
      <p>
        Якщо у вас є питання щодо цієї політики конфіденційності, будь ласка,
        зв'яжіться з нами за контактами які ви можете найти{" "}
        <Link href="/contacts">тут</Link>
      </p>
    </div>
  );
};

export default PrivacyPolicy;
